### Importing libraries

In [12]:
import pandas as pd
import numpy as np

### Making a list, dictionary, tuple to dataframe using pandas

In [13]:
lst = ['Soon', 'For', 'Good', 'is', 
            'portal', 'for', 'Good']

In [14]:
df = pd.DataFrame(lst)
print(df)

        0
0    Soon
1     For
2    Good
3      is
4  portal
5     for
6    Good

In [15]:
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [16]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
df = pd.DataFrame(data)
print(df[['Name', 'Qualification']])

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

### Read the data from CSV and view the data with the name

In [17]:
data = pd.read_csv("nba.csv", index_col ="Name")
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"] 
print(first, "\n\n\n", second)

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height               2-Jun
Weight                 180
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height               5-Jun
Weight                 185
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

### Retrive columns using indexing operatror

In [18]:
data = pd.read_csv("nba.csv", index_col ="Name")
first = data["Age"]
print(first)

Name
Avery Bradley    25
Jae Crowder      25
John Holland     27
R.J. Hunter      22
Jonas Jerebko    29
                 ..
Trey Lyles       20
Shelvin Mack     26
Raul Neto        24
Tibor Pleiss     26
Jeff Withey      26
Name: Age, Length: 457, dtype: int64

### Retrive the row by loc method

In [19]:
data = pd.read_csv("nba.csv", index_col ="Name")
row2 = data.iloc[3] 
print(row2)

Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height               5-Jun
Weight                 185
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

### isnull() function

In [20]:
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
df = pd.DataFrame(dict)
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

### Replace null values with 0 using fillna() function

In [21]:
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
df = pd.DataFrame(dict)
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

### Drop the rows which contains null values

In [22]:
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
df = pd.DataFrame(dict)
df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

### Dataframe using lists

In [23]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict)
print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

### Iterate through the dataframe

In [24]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict)
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object

### Iterate through the dataframe and print using indexing

In [25]:
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict)
print(df)
columns = list(df)
for i in columns:
    print (df[i][2])

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98
sudhir
M.Tech
80

### Print the head and tail of nba database

In [26]:
df2 = pd.read_csv("nba.csv")
print(df2.head())
print(df2.tail())

            Name            Team  Number Position  Age  Height  Weight  \
0  Avery Bradley  Boston Celtics       0       PG   25   2-Jun     180
1    Jae Crowder  Boston Celtics      99       SF   25   6-Jun     235
2   John Holland  Boston Celtics      30       SG   27   5-Jun     205
3    R.J. Hunter  Boston Celtics      28       SG   22   5-Jun     185
4  Jonas Jerebko  Boston Celtics       8       PF   29  10-Jun     231

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0
             Name       Team  Number Position  Age  Height  Weight   College  \
452    Trey Lyles  Utah Jazz      41       PF   20  10-Jun     234  Kentucky
453  Shelvin Mack  Utah Jazz       8       PG   26   3-Jun     203    Butler
454     Raul Neto  Utah Jazz      25       PG   24   1-Jun     179       NaN
455  Tibor Pleiss  Utah Jazz      21        C   26   3-Jul     256       NaN
456   Jeff Withey  Utah Jazz      24        C   26  Jul-00     231    Kansas

        Salary
452  2239800.0
453  2433333.0
454   900000.0
455  2900000.0
456   947276.0

### Print the type and info of the nba database

In [27]:
print("Type:\n",type(df2))
print("Information about the dataframe:\n",df2.info)

Type:
 <class 'pandas.core.frame.DataFrame'>
Information about the dataframe:
 <bound method DataFrame.info of               Name            Team  Number Position  Age  Height  Weight  \
0    Avery Bradley  Boston Celtics       0       PG   25   2-Jun     180
1      Jae Crowder  Boston Celtics      99       SF   25   6-Jun     235
2     John Holland  Boston Celtics      30       SG   27   5-Jun     205
3      R.J. Hunter  Boston Celtics      28       SG   22   5-Jun     185
4    Jonas Jerebko  Boston Celtics       8       PF   29  10-Jun     231
..             ...             ...     ...      ...  ...     ...     ...
452     Trey Lyles       Utah Jazz      41       PF   20  10-Jun     234
453   Shelvin Mack       Utah Jazz       8       PG   26   3-Jun     203
454      Raul Neto       Utah Jazz      25       PG   24   1-Jun     179
455   Tibor Pleiss       Utah Jazz      21        C   26   3-Jul     256
456    Jeff Withey       Utah Jazz      24        C   26  Jul-00     231

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University        NaN
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
452           Kentucky  2239800.0
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0

[457 rows x 9 columns]>

### Remove the duplicates and print the shape of the dataset

In [28]:
print("Shape of datafframe:",df2.shape)
df2.drop_duplicates()
print(df2.shape)

Shape of datafframe: (457, 9)
(457, 9)

### Print the description of the dataset

In [29]:
print("Columns of dataframe:\t",df2.columns)
print(df2.describe())

Columns of dataframe:	 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')
           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07